# --- تطبيق عملي على المتغيرات وطباعتها ---

# 1. حجزت أماكن في الذاكرة لبياناتي الأساسية
my_name = "Abdu"
my_age = 20
programming_language = "Python"

# 2. طباعة البيانات لأتأكد أن الكمبيوتر حفظها صح
print("--- البيانات الشخصية المسترجعة ---")
print("الاسم المحفوظ:", my_name)
print("العمر:", my_age)
print("اللغة التي أتعلمها حالياً:", programming_language)

print("---------------------------------")

# 3  تخيل أن سنة مرت، وعمري بمقرا_age = my_age + 1

# وتخيل أنني انتقلت لتعلّم مستوى متقدم في نفس اللغة
programming_language = "Advanced Python"

# 4. طباعة البيانات مجدداً بعد التعديل لمعاينة النتيجة
print("--- البيانات بعد التحديث (مرور سنة) ---")
print("العمر الجديد أصبح:", my_age)
print("المستوى الحالي في البرمجة:", programming_language)
