# عدد المقالات الكلي التي يريد العميل كتابتها    
articles_count = 16  
#  مقالة يستطيع كاتب المقالات إنهاءها في اليوم الواحد 
articles_per_day = 2
# تقسيم عدد المقالات الكلي على عدد المقالات في اليوم الواحد
days_needed = int(articles_count / articles_per_day)
# طبع
print ("--------مقالات------------")
print ("عدد المقالات الكليه:",articles_count)
print ("انهاء المقالات في اليوم الوحد:",articles_per_day)
print ("الايام المتبقيه لانهاء المقالات:",days_needed)
print ("---------------------------")